from ABH import *
info = {
    'اوامر المجموعه': ('.كتم', 'لكتم شخص في المجموعه او الخاص بالرد'),
    'اوامر المجموعه': ('.الغاء كتم', 'ل الغاء كتم شخص في المجموعه او الخاص بالرد'),
    'اوامر المجموعه': ('.تقييد', 'لتقييد الشخص بالرد عليه'),
    'اوامر المجموعه': ('.ازعاج', 'الامر يشتغل مثل `ازعاج 🍌`\n يرسل تفاعل على كل رسائل الشخص بالرد'),
    'اوامر المجموعه': ('.الغاء ازعاج', 'يحذف جلسة الازعاج وينهي التفاعلات'),
    'اوامر المجموعه': ('.تثبيت', 'لتثبيت الرساله بالرد'),
    'اوامر المجموعه': ('.الغاء تثبيت', 'ل الغاء تثبيت الرساله بالرد'),
    'اوامر المجموعه': ('.مسح', 'لحذف الرسالة بالرد عليها'),
    'اوامر عشوائيه': ('.الايدي', 'يرجعلك ايدي المحادثه مع ايدي الشخص بالرد'),
    'اوامر عشوائيه': ('.وقتي', 'يشتغل الامر مثل \n `وقتي 4 اهلا` يحذف الرسالة بعد اربع ثواني'),
    'اوامر عشوائيه': ('.وسبام', 'يشتغل الامر مثل `.وسبام اهلا كيف الحال`\n الامر يرسل كل كلمة على حدا ب رساله منفصلة'),
    'اوامر عشوائيه': ('.متى', 'الامر يرسل الك وقت ارسال الرساله وتكدر تشغله بالرد'),
    'اوامر عشوائيه': ('.عداد', 'الامر يحتاج تخلي وياه رقم علمود يسوي الك عد تنازلي'),
    'اوامر عشوائيه': ('.خاص', 'يحفظ الرسالة بالرد للمحادثة الخاصة'),
    'اوامر الحساب': ('.معلوماتي', 'الامر يجمع لك كل معلومات حسابك من محادثات'),
    'اوامر الحساب': ('.تغيير اسمي', 'يشتغل مثل `تغيير اسمي ادم` يغير اسم حسابك الى ادم'),
    'اوامر الحساب': ('.تغيير صورتي', 'يشتغل مثل `تغيير اسمي ادم` يغير صوره حسابك الى الصوره بالرد'),
    'اوامر الحساب': ('.حذف صورتي', 'يحذف اخر افتار الك بالحساب'),
    'اوامر الحساب': ('.بلوك', 'يسوي بلوك للشخص الي سويت عليه رد او انت ب محادثته'),
    'اوامر الحساب': ('.الغاء بلوك', 'يلغي البلوك من الشخص بالرد'),
    'اوامر اعدادات السورس': ('.اضف كروب التخزين', 'يغيرلك كروب التخزين للي انت بالرد'),
    'اوامر اعدادات السورس': ('.اضف كروب الاشعارات', 'يضيفلك كروب اشعارات لكن غير مستخدم حاليا'),
    'اوامر التفاعلات': ('.اضف', 'الامر يشتغل مثلا `اضف ايدي + الايموجي` السورس راح يسوي تفاعل بالايموجي الي عينته '),
    'اوامر التفاعلات': ('.احذف', 'الامر راح يحذف الايدي من التفاعلات ويحذف الايموجي ايضا'),
    'اوامر التفاعلات': ('.القنوات', 'الامر يرجعلك القنوات المضافة للتفاعلات والتفاعلات'),
    'اوامر الذاتية': ('.جلب', 'الامر يشتغل مع روابط تلكرام او بالرد حته يخزنلك الميديا المحفوظة'),
    'اوامر الذاتية': ('.الامر التلقائي', 'الميديا بالخاص الذاتية هيه تلقائية الحفظ لا حاجة ل اي امر'),
    'اوامر الصيد': ('.الصيد تفعيل', 'الامر راح يفعلك حلقة الصيد'),
    'اوامر الصيد': ('.الصيد تعطيل', 'الامر راح يعطل الك حلقة الصيد'),
    'اوامر الصيد': ('.صيد', 'الامر يشتغل مثل `صيد @wfffp` الامر راح يحفظ اليوزر و يتأكد من حاله توفره'),
    'اوامر الصيد': ('.حالة الصيد', 'يرجعلك حالة الصيد من معلومات'),
    'اوامر الميمز': ('.الميمز', 'يرجعلك قائمة بصمات الميمز المتوفره'),
    'اوامر الالعاب': ('.اسرع', 'الامر راح يفعلك لعبة اسرع ب مخفي وراح يجاوب عليه ب مده قليله'),
    'اوامر الالعاب': ('.كلمات', 'الامر يشتغل مثل `كلمات 2 4` راح يفعل و يجاوب على رسالتين ب مده 4 ثواني'),
    'اوامر الالعاب': ('.تركيب', 'الامر يشتغل مثل `تركيب 2 4` راح يفعل و يجاوب على رسالتين ب مده 4 ثواني'),
    'اوامر الالعاب': ('.تفكيك', 'الامر يشتغل مثل `تفكيك 2 4` راح يفعل و يجاوب على رسالتين ب مده 4 ثواني'),
    'اوامر الالعاب': ('.احسب', 'الامر يشتغل مثل `احسب 2 4` راح يفعل و يجاوب على رسالتين ب مده 4 ثواني'),
}
@ABH.on(events.NewMessage(pattern=r'^.الاوامر$', outgoing=True))
async def commands(e):
    text = ''
    for arg in info.keys():
        text += f"`{arg}`\n"
    await e.edit(text)
@ABH.on(events.NewMessage(outgoing=True))
async def custom_commands(e):
    if e.text not in info:return
    command, arg = info[e.text]
    text = f'الامر `{command}` \n {arg}'
    await e.edit(text)
